Documents/SMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>SMS</Name>
			<Comment>Документ реализует работу с WEB SMS</Comment>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
				<xr:Item>Document.ПоступлениеАвтомобилей</xr:Item>
				<xr:Item>Document.РеализацияАвтомобилей</xr:Item>
				<xr:Item>Document.СчетНаОплатуЗаАвтомобили</xr:Item>
				<xr:Item>Document.ЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.ЗаявкаНаХранениеШин</xr:Item>
				<xr:Item>Document.РабочийЛист</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Входящее_Исходящее</Name>
					<Comment>Тип сообщения входящий/исходящий</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Comment>Текст сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОДоставке</Name>
					<Comment>Признак запроса отчета о доставке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправителя</Name>
					<Comment>Номер отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDSMSСообщения</Name>
					<Comment>GUID SMS Сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокой</Name>
					<Comment>Статус сообщения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Comment>Список получателей, представляется строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтотекстБулево</Name>
					<Comment>Признак того что в сообщении есть автотекст</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ на основании которого создан новый документ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Наименование фирмы, в которой создан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаЗапрета</Name>
					<Comment>Конец периода запрета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтправки</Name>
					<Comment>Начало отправки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаЗапрета</Name>
					<Comment>Начало периода запрета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьSMS</Name>
					<Comment>Не отправлять SMS</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РавномернаяРассылка</Name>
					<Comment>Равномерная рассылка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагАктуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Comment>Актуальность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.смсСостоянияСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Comment>Номер телефона получателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Comment>Статус текущего SMS</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершения</Name>
							<Comment>Дата последнего изменения статуса</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Comment>Описание ошибки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID_SMS</Name>
							<Comment>GUID SMS</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>38</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Comment>Текст сообщения в случае если используется автотекст</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактнаяИнформация</Name>
							<Comment>Контактная информация строкой</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецКИ</Name>
							<Comment>Владелец КИ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонтактнойИнформации</Name>
							<Comment>Тип контактной информации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Миллисекунда</Name>
							<Comment>Количество миллисекунд</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/смсСостоянияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>смсСостоянияСообщений</Name>
			<Comment>Состояния сообщений</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GUID</Name>
					<Comment>Уникальный идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.смсСостоянияСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sms_id</Name>
					<Comment>Идентификатор СМС Билайн</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Comment>Номер строки документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/смсСостоянияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>смсСостоянияСообщений</Name>
			<Comment>Состояния Сообщений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
					<Comment>Сообщение ждет отправки на сервер SMS4B</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
					<Comment>Сообщение отправлено на сервер SMS4B и ждёт отправки оператору</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
					<Comment>Сообщение отправлено на сервер оператору</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлено</Name>
					<Comment>Сообщение не удалось отправить на сервер оператору (истек срок жизни sms сообщения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
					<Comment>Сообщение доставлено клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДоставлено</Name>
					<Comment>Сообщение не доставлено клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Сообщение не удалось отправить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
					<Comment>Получено входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоЧастично</Name>
					<Comment>Получены не все части входящего сообщения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОператорыSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОператорыSMS</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS4B</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Билайн</Name>
					<Comment>Сервис отправки и приёма SMS сообщений beeline.amega-inform.ru</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/SMS/Ext/ObjectModule.bsl
Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

//Формирование текста сообщения по шаблону
Функция СформироватьСообщениеПоШаблону(Шаблон,ТекКонтакт, СтрокаОшибкиФункции = Неопределено) Экспорт
	Если ТипЗнч(ТекКонтакт) = Тип("Строка") Тогда
		ИмяАдресата = ТекКонтакт;
	Иначе
		ИмяАдресата = ТекКонтакт.Наименование;
	КонецЕсли;
	ШаблонТекст = СтрЗаменить(Шаблон, "%ИМЯ%", ИмяАдресата);
	Возврат ШаблонТекст;
	//////////////////////////////////////////////////////////
	
	ШаблонТекст = Шаблон;//.Содержание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Действия.Действие,
	|	Действия.Представление
	|ИЗ
	|	Справочник.Действия КАК Действия
	|ГДЕ
	|	Действия.Автотекст = &Автотекст";
	
	Запрос.УстановитьПараметр("Автотекст",Истина);			   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Найти(ШаблонТекст,Выборка.Представление) Тогда
			
			ЗначениеМакроса = "";
			Выражение = Выборка.Действие;
			Автотекст = ""; //переменной при выполнении макроса передается результат 
			Попытка
				Выполнить(Выражение);	
				ШаблонТекст = СтрЗаменить(ШаблонТекст, Выборка.Представление, Автотекст);
			Исключение
				ШаблонТекст = СтрЗаменить(ШаблонТекст,Выборка.Представление,"");
				Если СтрокаОшибкиФункции = Неопределено Тогда
					Сообщить(ОписаниеОшибки());
					Сообщить("Заполнение по автотексту " + Выборка.Представление  +" не выполнено!");
				Иначе
					СтрокаОшибкиФункции = ОписаниеОшибки() + Символы.ПС + "Заполнение по автотексту " + Выборка.Представление  +" не выполнено!";
				КонецЕсли;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат  ШаблонТекст;	
КонецФункции

// Функция заполненность обязательных полей
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Булево	- Заполненность обязательных полей
//
Функция ПроверитьЗаполнениеПолей(СтрокаОшибкиФункции = Неопределено) Экспорт
	Отказ = Ложь;
	СтруктураОбязательныхПолей = Новый Структура("Входящее_Исходящее, НомерОтправителя, Автор, НачалоОтправки");
	смсРаботаССообщениями.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, "");
	Если ФлагАктуальность И НЕ ЗначениеЗаполнено(Актуальность) Тогда
		Отказ = Истина;
	КонецЕсли; 
	Если Получатели.Количество() = 0 Тогда
		Если СтрокаОшибкиФункции = Неопределено Тогда
			Сообщить(НСтр("ru = 'Не указаны получатели сообщения!'"), СтатусСообщения.Важное);
		Иначе
			СтрокаОшибкиФункции = "Не указаны получатели сообщения!";
		КонецЕсли;
		Отказ = Истина;
	Иначе
		СписокТелефонов = Новый СписокЗначений;
		Для Каждого Получатель Из Получатели Цикл
			Если ТипЗнч(Получатель.Контрагент) = Тип("Строка") Тогда
				стркКонтрагент = Получатель.Контрагент;
			Иначе
				стркКонтрагент = Получатель.Контрагент.Наименование;
			КонецЕсли;
			
			Если ПустаяСтрока(Получатель.НомерТелефона) Тогда
				Если СтрокаОшибкиФункции = Неопределено Тогда
					Сообщить(НСтр("ru = 'Для получателя " + стркКонтрагент + " не указан номер телефона!'"), СтатусСообщения.Важное);
				Иначе
					СтрокаОшибкиФункции = НСтр("ru = 'Для получателя " + стркКонтрагент + " не указан номер телефона!'");
				КонецЕсли;
				Отказ = Истина;
			Иначе
				Если СписокТелефонов.НайтиПоЗначению(Получатель.НомерТелефона) = Неопределено Тогда
					СписокТелефонов.Добавить(Получатель.НомерТелефона);
				Иначе	
					Если СтрокаОшибкиФункции = Неопределено Тогда
						Сообщить(НСтр("ru = 'Номер телефона " + Получатель.НомерТелефона + " контрагента " + стркКонтрагент 
						+ " уже присутствует в таблице получателей!'"), СтатусСообщения.Важное);
					Иначе
						СтрокаОшибкиФункции = НСтр("ru = 'Номер телефона " + Получатель.НомерТелефона + " контрагента " + стркКонтрагент 
						+ " уже присутствует в таблице получателей!'");
					КонецЕсли;
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			// Портал Билайн рассылает одинаковый текст по списку номеров абонентов!
			//Если НЕ ЗначениеЗаполнено(Получатель.ТекстСообщения) Тогда
			//	Если СтрокаОшибкиФункции = Неопределено Тогда
			//		Сообщить(НСтр("ru = 'Не заполнен текст сообщения в строке " + Строка(Получатель.НомерСтроки)+"'"));
			//	Иначе
			//		СтрокаОшибкиФункции = НСтр("ru = 'Не заполнен текст сообщения в строке " + Строка(Получатель.НомерСтроки)+"'");
			//	КонецЕсли;
			//	Отказ = Истина;
			//КонецЕсли; 
		КонецЦикла;
		
		Если обЗначениеНеЗаполнено(ТекстСообщения) Тогда
			Если СтрокаОшибкиФункции = Неопределено Тогда
				Сообщить(НСтр("ru = 'Не заполнен текст сообщения!'"), СтатусСообщения.Важное);
			Иначе
				СтрокаОшибкиФункции = "Не заполнен текст сообщения!";
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат НЕ Отказ;	
КонецФункции // ПроверитьЗаполнениеПолей()

// Функция проверяет возможность отправки сообщения по введенным интервалам
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Булево	- Возможность отправки сообщения
//
Функция ПроверитьВозможностьОтправки(СтрокаОшибкиФункции = Неопределено)
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы()); // Srvr="1cserver";Ref="alfaauto";
	ЭтоРабочаяБаза = СтрНайти(СтрокаСоединения, "1cserver") > 0 И СтрНайти(СтрокаСоединения, "alfaauto") > 0;
	Если Не ЭтоРабочаяБаза Тогда
		Если СтрокаОшибкиФункции = Неопределено Тогда
			Сообщить("Отправка СМС возможна только из рабочей базы!", СтатусСообщения.Важное);
		Иначе
			СтрокаОшибкиФункции = "Отправка СМС возможна только из рабочей базы!";
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Актуальность) И Актуальность < НачалоОтправки + 900 Тогда
		Если СтрокаОшибкиФункции = Неопределено Тогда
			Сообщить(НСтр("ru = 'Дата актуальности сообщения должна быть больше даты отправки не менее чем на 15 минут!'"), СтатусСообщения.Важное);
		Иначе
			СтрокаОшибкиФункции = НСтр("ru = 'Дата актуальности сообщения должна быть больше даты отправки не менее чем на 15 минут!'");
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ НеОтправлятьSMS Тогда Возврат Истина; КонецЕсли;
	
	Если КонецПериодаЗапрета > НачалоПериодаЗапрета Тогда
		ДлинаПериодаЗапрета = КонецПериодаЗапрета - НачалоПериодаЗапрета;
	Иначе	
		ДлинаПериодаЗапрета = КонецПериодаЗапрета - НачалоПериодаЗапрета + 86400;
	КонецЕсли;
	
	Если (КонецПериодаЗапрета = НачалоПериодаЗапрета) ИЛИ (ДлинаПериодаЗапрета = 86399) Тогда
		Если СтрокаОшибкиФункции = Неопределено Тогда
			Сообщить(НСтр("ru = 'Период запрета отправки составляет полные сутки!'"), СтатусСообщения.Важное);
		Иначе
			СтрокаОшибкиФункции = НСтр("ru = 'Период запрета отправки составляет полные сутки!'");
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если (Актуальность - НачалоОтправки) > ДлинаПериодаЗапрета Тогда Возврат Истина; КонецЕсли;
	
	Если (НачалоОтправки - НачалоДня(НачалоОтправки)) < (НачалоПериодаЗапрета - Дата('00010101')) Тогда Возврат Истина; КонецЕсли;
	
	Если КонецПериодаЗапрета > НачалоПериодаЗапрета Тогда
		Если (НачалоОтправки - НачалоДня(НачалоОтправки)) > (КонецПериодаЗапрета - Дата('00010101')) Тогда
			Возврат Истина;
		ИначеЕсли (Актуальность - НачалоДня(Актуальность)) > (КонецПериодаЗапрета - Дата('00010101')) Тогда
			Возврат Истина;
		Иначе
			Если СтрокаОшибкиФункции = Неопределено Тогда
				Сообщить(НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'"), СтатусСообщения.Важное);
			Иначе
				СтрокаОшибкиФункции = НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'");
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если (Актуальность - НачалоДня(Актуальность)) > (НачалоПериодаЗапрета - Дата('00010101')) Тогда
			Если СтрокаОшибкиФункции = Неопределено Тогда
				Сообщить(НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'"), СтатусСообщения.Важное);
			Иначе
				СтрокаОшибкиФункции = НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'");
			КонецЕсли;
			Возврат Ложь;
		ИначеЕсли (Актуальность - НачалоДня(Актуальность)) < (КонецПериодаЗапрета - Дата('00010101')) Тогда
			Если СтрокаОшибкиФункции = Неопределено Тогда
				Сообщить(НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'"), СтатусСообщения.Важное);
			Иначе
				СтрокаОшибкиФункции = НСтр("ru = 'Начало отправки и актуальность находятся внутри периода запрета отправки!'");
			КонецЕсли;
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПроверитьВозможностьОтправки()

// Записывает в регистр статусов статусы новых сообщений
//
Процедура ЗаписатьСтатусыВРегистр() Экспорт
	// Семенихин 27.05.2022 +++++
	Если обЗначениеНеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	// Семенихин 27.05.2022 -----
	
	НаборЗаписей = РегистрыСведений.смсСостоянияСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сообщение.Значение = ЭтотОбъект.Ссылка;
	НаборЗаписей.Отбор.Сообщение.Использование = Истина;
	
	Для Каждого Строка Из Получатели Цикл
		НовСтрока = НаборЗаписей.Добавить();
		НовСтрока.Сообщение = ЭтотОбъект.Ссылка;
		НовСтрока.НомерСтрокиДокумента = Строка.НомерСтроки;
		НовСтрока.GUID = Строка.GUID_SMS;
		НовСтрока.Статус = Перечисления.смсСостоянияСообщений.Доставка;
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

//отправка SMS получателям
Функция ОтправитьSMS() Экспорт	
	Результат = "";
	Если НЕ ПроверитьЗаполнениеПолей(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьОтправки(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТекущееСообщение Из Получатели Цикл
		ТекущееСообщение.GUID_SMS = Новый УникальныйИдентификатор;
	КонецЦикла;
	
	Если Константы.ОператорSMS.Получить() = Перечисления.ОператорыSMS.Билайн Тогда
		ЗаписатьСтатусыВРегистр();
		смсКоммуникаторБилайн.ОтправкаСообщенийДокумента(ЭтотОбъект.Ссылка);	
	//Иначе
	//	ЗаписатьСтатусыВРегистр();
	//	смсРаботаССообщениями.РегламентноеЗаданиеПроверкаСМС(Истина);
	КонецЕсли;
	
	ПолучитьСтатусыСообщений();
	СтруктураСтатуса = ПолучитьСтатусДокумента();
	СтатусСтрокой    = СтруктураСтатуса.СтатусСтрокой;
	Статус           = СтруктураСтатуса.Статус;
	
	Записать();		
	Возврат Результат;
КонецФункции

// Функция возвращает статус документа
//
// Параметры:
//	Нет.
//
//
Функция ПолучитьСтатусДокумента() Экспорт
	
	СтруктураСтатуса = Новый Структура;
	СтруктураСтатуса.Вставить("Статус", Перечисления.смсСостоянияСообщений.ПустаяСсылка());
	СтруктураСтатуса.Вставить("СтатусСтрокой", "");
	
	ВсегоКоличество 			= Получатели.Количество();
	КоличествоОтправляемых		= 0;
	КоличествоВОчереди 			= 0;
	КоличествоОтправленных 		= 0;
	КоличествоНеОтправленных	= 0;
	КоличествоДоставленных 		= 0;
	КоличествоНеДоставленных	= 0;
	КоличествоОшибок 			= 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	смсСостоянияСообщений.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.смсСостоянияСообщений КАК смсСостоянияСообщений
	|ГДЕ
	|	смсСостоянияСообщений.Сообщение = &Док";
	Запрос.УстановитьПараметр("Док", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	 
	Для Каждого ТекСтрокаДокумента Из РезультатЗапроса Цикл
		Если ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.ПустаяСсылка() Тогда
			Продолжить;	
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.Доставка Тогда
			КоличествоОтправляемых = КоличествоОтправляемых + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.ВОчереди Тогда
			КоличествоВОчереди = КоличествоВОчереди + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.Отправлено Тогда
			КоличествоОтправленных 	= КоличествоОтправленных + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.НеОтправлено Тогда
			КоличествоНеОтправленных = КоличествоНеОтправленных + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.Доставлено Тогда
			КоличествоДоставленных 	= КоличествоДоставленных + 1;
			КоличествоОтправленных 	= КоличествоОтправленных + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.НеДоставлено Тогда
			КоличествоНеДоставленных = КоличествоНеДоставленных + 1;
			КоличествоОтправленных 	= КоличествоОтправленных + 1;
		ИначеЕсли ТекСтрокаДокумента.Статус = Перечисления.смсСостоянияСообщений.Ошибка Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоОтправляемых >  0 Тогда
		СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.Доставка; 	
	ИначеЕсли КоличествоВОчереди > 0 Тогда
		СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.ВОчереди; 	
	ИначеЕсли КоличествоОтправленных > 0 Тогда
		Если КоличествоОтправленных = КоличествоДоставленных Тогда
			СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.Доставлено; 	
		Иначе
			СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.Отправлено; 	
		КонецЕсли;
	ИначеЕсли КоличествоНеДоставленных > 0 Тогда	
		СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.НеДоставлено; 	
	ИначеЕсли КоличествоНеОтправленных > 0 Тогда	
		СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.НеОтправлено; 	
	ИначеЕсли КоличествоОшибок > 0 Тогда	
		СтруктураСтатуса.Статус = Перечисления.смсСостоянияСообщений.Ошибка; 	
	КонецЕсли;
	
    СтруктураСтатуса.СтатусСтрокой = НСтр("ru = 'Всего: '") + ВсегоКоличество + ";"
    + ?((КоличествоВОчереди + КоличествоОтправленных + КоличествоНеОтправленных + КоличествоДоставленных 
    + КоличествоНеДоставленных + КоличествоОшибок = 0), НСтр("ru = 'SMS записано, но не отправлено'"), НСтр("ru = ' из них:'"))
    + ?(КоличествоВОчереди = 0, "", НСтр("ru = ' в очереди-'") + КоличествоВОчереди + ";")
    + ?(КоличествоОтправленных = 0, "", НСтр("ru = ' отправлено-'") + КоличествоОтправленных + ";")
    + ?(КоличествоНеОтправленных = 0, "", НСтр("ru = ' не отправлено-'") + КоличествоНеОтправленных + ";")
    + ?(КоличествоДоставленных = 0, "", НСтр("ru = ' доставлено-'") + КоличествоДоставленных + ";")
    + ?(КоличествоНеДоставленных = 0, "", НСтр("ru = ' не доставлено-'") + КоличествоНеДоставленных + ";")
    + ?(КоличествоОшибок = 0, "", НСтр("ru = ' ошибок-'") + КоличествоОшибок);
	
	Возврат СтруктураСтатуса;
	
КонецФункции // СтатусСтрокойДокумента()

//Процедура заполняет строку ТЧ из переданной записи КИ
//
Процедура ЗаполнитьСтрокуИзКонтактнойИнформации(Значение,Строка)Экспорт
	Строка.НомерТелефона = кмУбратьЛишниеСимволыТелефона(СокрЛП(Значение.Поле1)+СокрЛП(Значение.Поле2)+СокрЛП(Значение.Поле3));
	Строка.Статус = "НеОтправлено";
КонецПроцедуры	

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация", 1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании", 1);
	ОбязательныеРеквизиты.Вставить("Автор", 1);
	ОбязательныеРеквизиты.Вставить("ХозОперация", 1);
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность, Истина);
КонецФункции // ПроверитьКорректность()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("SMS", "SMS", Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

//Функция предназначена для обработки изменения реквизита объекта
// Возвращает признак удачной обработки
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);	
	
КонецФункции

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// ПолучитьСтатусыСообщений
//
Процедура ПолучитьСтатусыСообщений() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	смсСостоянияСообщений.GUID,
	               |	смсСостоянияСообщений.Статус,
	               |	смсСостоянияСообщений.ОписаниеОшибки,
	               |	смсСостоянияСообщений.НомерСтрокиДокумента
	               |ИЗ
	               |	РегистрСведений.смсСостоянияСообщений КАК смсСостоянияСообщений
	               |ГДЕ
	               |	смсСостоянияСообщений.Сообщение = &СсылкаНаДокумент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	смсСостоянияСообщений.НомерСтрокиДокумента";
	Запрос.УстановитьПараметр("СсылкаНаДокумент", ЭтотОбъект.Ссылка);
	ВыборкаСтатусов=Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтатусов.Следующий() Цикл
		СтрокаТЧ=Получатели.Найти(ВыборкаСтатусов.GUID,"GUID_SMS");
		Если СтрокаТЧ<>Неопределено Тогда
			Если СтрокаТЧ.Статус<>Строка(ВыборкаСтатусов.Статус) Тогда
				СтрокаТЧ.Статус=ВыборкаСтатусов.Статус;
			КонецЕсли; 
			Если СтрокаТЧ.ОписаниеОшибки<>ВыборкаСтатусов.ОписаниеОшибки Тогда
				СтрокаТЧ.ОписаниеОшибки=ВыборкаСтатусов.ОписаниеОшибки;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры


#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	Возврат СтруктураМакетов;
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//Обработчик установки нового номера документа
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

//Обработка заполнения нового документа
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	НачалоОтправки			= Дата;
	НачалоПериодаЗапрета	= Константы.смсНачалоПериодаЗапрета.Получить();
	КонецПериодаЗапрета		= Константы.смсКонецПериодаЗапрета.Получить();
	РавномернаяРассылка		= Ложь;
	АвтотекстБулево			= Ложь;
	Транслитерация			= Ложь;
    		
	Если Основание <> Неопределено И ЗначениеЗаполнено(Основание) Тогда
		ДокументОснование = Основание;
		Входящее_Исходящее = Перечисления.ТипыСообщений.Исходящее;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
			// Заполнение шапки
			Огранизация = Основание.Организация;
			ПодразделениеКомпании = Основание.ПодразделениеКомпании;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РабочийЛист") Тогда
			Организация = Основание.Организация;
			ПодразделениеКомпании = Основание.ПодразделениеКомпании;
			НоваяСтрока = Получатели.Добавить();
			НоваяСтрока.Контрагент = Основание.Контрагент;
			НоваяСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрока.КонтактнаяИнформация = Основание.ПредставлениеТелефона;		
			НоваяСтрока.НомерТелефона = НоваяСтрока.КонтактнаяИнформация;		
			
		ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Контрагенты") Тогда
			Организация = ПараметрыСеанса.Организация;
			ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			НоваяСтрока = Получатели.Добавить();
			НоваяСтрока.Контрагент = Основание;
			НоваяСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//поищем мобильный телефон
			НоваяСтрока.КонтактнаяИнформация = Основание.ОсновнойТелефон;
			Если обЗначениеНеЗаполнено(НоваяСтрока.КонтактнаяИнформация) Тогда
				НоваяСтрока.КонтактнаяИнформация = ПолучитьТелефон(Основание);
			КонецЕсли;		
			НоваяСтрока.НомерТелефона = НоваяСтрока.КонтактнаяИнформация;		
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Организация = Основание.Организация;
			ПодразделениеКомпании = Основание.ПодразделениеКомпании;
			НоваяСтрока = Получатели.Добавить();
			НоваяСтрока.Контрагент = Основание.Заказчик;
			НоваяСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//поищем мобильный телефон
			НоваяСтрока.КонтактнаяИнформация = ПолучитьТелефон(НоваяСтрока.Контрагент);
			НоваяСтрока.НомерТелефона = НоваяСтрока.КонтактнаяИнформация;		
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			Организация = Основание.Организация;
			ПодразделениеКомпании = Основание.ПодразделениеКомпании;
			НоваяСтрока = Получатели.Добавить();
			НоваяСтрока.Контрагент = Основание.Заказчик;
			НоваяСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//поищем мобильный телефон
			Если ТипЗнч(НоваяСтрока.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				НоваяСтрока.КонтактнаяИнформация = ПолучитьТелефон(НоваяСтрока.Контрагент);
			Иначе
				НоваяСтрока.КонтактнаяИнформация = Основание.ПредставлениеТелефона;
			КонецЕсли;		
			НоваяСтрока.НомерТелефона = НоваяСтрока.КонтактнаяИнформация;		
			
		Иначе
			Попытка
				Организация = Основание.Организация;
				ПодразделениеКомпании = Основание.ПодразделениеКомпании;
				НоваяСтрока = Получатели.Добавить();
				НоваяСтрока.Контрагент = Основание.Контрагент;
				НоваяСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
				//поищем мобильный телефон
				НоваяСтрока.КонтактнаяИнформация = ПолучитьТелефон(НоваяСтрока.Контрагент);
				НоваяСтрока.НомерТелефона = НоваяСтрока.КонтактнаяИнформация;
			Исключение
			КонецПопытки;
		КонецЕсли;		
	КонецЕсли;
	
	// Семенихин 14.10.2025 +++++
	ЭтоПрайд = ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Малиновского43
	Или ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Малиновского43А
	Или ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Вавилова59Г
	Или ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Вавилова59К
	Или ПодразделениеКомпании.ДилерскийЦентр = Справочники.ДилерскиеЦентры.Текучева354;
	
	Если ЭтоПрайд Тогда
		НомерОтправителя = "PRIDECARSru";
	Иначе
		НомерОтправителя = Константы.смсИмяПользователяПоУмолчанию.Получить();
	КонецЕсли;
	// Семенихин 14.10.2025 -----
КонецПроцедуры

//Обработчик копирования документа
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

//Обработчик перед записью документа
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Семенихин 28.01.2021 +++++
	Если Константы.ОператорSMS.Получить() = Перечисления.ОператорыSMS.Билайн Тогда
		Если стрДлина(ТекстСообщения) > 480 Тогда //480
			#Если Клиент Тогда
			Предупреждение
			("Длина текста СМС не должна превышать 480 символов!" +
			Символы.ПС + Символы.ПС + "Сократите текст СМС.",, "Проверка текста СМС");
			#КонецЕсли
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Семенихин 28.01.2021 -----
	
	Если Входящее_Исходящее = Перечисления.ТипыСообщений.Исходящее Тогда
		СтруктураСтатуса = ПолучитьСтатусДокумента();
		СтатусСтрокой = СтруктураСтатуса.СтатусСтрокой;
		Статус        = СтруктураСтатуса.Статус;
	КонецЕсли;
	
	СписокПолучателей="";
	Для Каждого ТекущаяСтрока Из Получатели Цикл 
		Если (ТекущаяСтрока.Контрагент = Неопределено) ИЛИ (обЗначениеНеЗаполнено(ТекущаяСтрока.Контрагент)) ИЛИ (ТипЗнч(ТекущаяСтрока.Контрагент) = Тип("Строка")) Тогда 
			СписокПолучателей=ТекущаяСтрока.НомерТелефона+СписокПолучателей;
		Иначе	
			СписокПолучателей=ТекущаяСтрока.Контрагент.Наименование+СписокПолучателей;
		КонецЕсли;
	КонецЦикла;
	
	// Семенихин 27.05.2022 +++++
	УдалитьДубликатыТелефонов();
	//Если обЗначениеНеЗаполнено(Актуальность) Тогда
	//	Актуальность = НачалоОтправки + 900;
	//КонецЕсли;
	Если обЗначениеНеЗаполнено(НачалоПериодаЗапрета) Тогда
		НачалоПериодаЗапрета = Дата(1, 1, 1, 23, 59, 59);
	КонецЕсли;
	// Семенихин 03.06.2022 -----
КонецПроцедуры // ПередЗаписью()

//Обработчик при записи документа
Процедура ПриЗаписи(Отказ)
	
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Входящее_Исходящее = Перечисления.ТипыСообщений.Исходящее Тогда
	КонецЕсли;
	
КонецПроцедуры

//Обработчик перед удалением документа
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()
	
// Семенихин 30.03.2020 +++++
Функция ПолучитьТелефон(Объект) Экспорт
	Представление = "";
	Представление = киПолучитьПредставлениеКИ(Объект, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Если ЗначениеЗаполнено(Представление) Тогда Возврат Представление; КонецЕсли;
		
	Представление = киПолучитьПредставлениеКИ(Объект, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Если ЗначениеЗаполнено(Представление) Тогда Возврат Представление; КонецЕсли;
		
	Представление = киПолучитьПредставлениеКИ(Объект, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ЗначениеЗаполнено(Представление) Тогда Возврат Представление; КонецЕсли;
	
	Возврат Представление;
КонецФункции

Процедура УдалитьДубликатыТелефонов()
	мТелефоны = Новый Массив();
	мСтрокиДляУдаления = Новый Массив();
	
	Для Каждого СтрокаПолучатель Из Получатели Цикл
		Если мТелефоны.Найти(СтрокаПолучатель.НомерТелефона) = Неопределено Тогда
			мТелефоны.Добавить(СтрокаПолучатель.НомерТелефона);
		Иначе
			мСтрокиДляУдаления.Добавить(СтрокаПолучатель);
		КонецЕсли;		
	КонецЦикла;
	
	Если мСтрокиДляУдаления.Количество() > 0 Тогда
		Для Каждого СтрокаДляУдаления Из мСтрокиДляУдаления Цикл
			Получатели.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
// Семенихин 27.05.2022 -----

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
